app/controllers/items_controller.rb

  def index
    @items = Item.order("items.created_at DESC")
    @available_item_count = Item.where(:status => true).size
---
SELECT `items`.* FROM `items` ORDER BY items.created_at DESC
SELECT COUNT(*) FROM `items` WHERE `items`.`status` = 1

  def show
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1

  def edit
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`color`, `created_at`, `location`, `lot_number`, `quantity`, `size`, `slab_number`, `status`, `thickness`, `updated_at`) VALUES ('dfsdf', '2012-10-13 18:13:39', 'ny', 3, 43, '43', '43443', 1, 54.0, '2012-10-13 18:13:39')

  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
UPDATE `items` SET `location` = 'In Transit (ETA 11/5/12)', `status` = 0, `updated_at` = '2012-10-20 17:54:39' WHERE `items`.`id` = 795

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 1

  def delete_all
    Item.destroy_all
---
DELETE FROM `items` WHERE `items`.`id` = 25